Masmiseim36/nxpSDK/boards/evkbmimxrt1170/usb_examples/usb_device_cdc_ecm_nic/freertos/cm7/pin_mux.c
/**
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAB
mcu_data: ksdk2_0
processor_version: 0.2412.60
board: MIMXRT1170-EVKB
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitENET_1GPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSDRAMPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: F3, peripheral: SEMC, signal: 'DATA, 00', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: F2, peripheral: SEMC, signal: 'DATA, 01', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: G4, peripheral: SEMC, signal: 'DATA, 02', pin_signal: GPIO_EMC_B1_02}
  - {pin_num: E4, peripheral: SEMC, signal: 'DATA, 03', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: H5, peripheral: SEMC, signal: 'DATA, 04', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: F4, peripheral: SEMC, signal: 'DATA, 05', pin_signal: GPIO_EMC_B1_05}
  - {pin_num: H4, peripheral: SEMC, signal: 'DATA, 06', pin_signal: GPIO_EMC_B1_06}
  - {pin_num: H3, peripheral: SEMC, signal: 'DATA, 07', pin_signal: GPIO_EMC_B1_07}
  - {pin_num: F5, peripheral: SEMC, signal: 'DM, 0', pin_signal: GPIO_EMC_B1_08}
  - {pin_num: A3, peripheral: SEMC, signal: 'ADDR, 00', pin_signal: GPIO_EMC_B1_09}
  - {pin_num: A2, peripheral: SEMC, signal: 'ADDR, 01', pin_signal: GPIO_EMC_B1_10}
  - {pin_num: C2, peripheral: SEMC, signal: 'ADDR, 02', pin_signal: GPIO_EMC_B1_11}
  - {pin_num: C5, peripheral: SEMC, signal: 'ADDR, 03', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: D5, peripheral: SEMC, signal: 'ADDR, 04', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: B1, peripheral: SEMC, signal: 'ADDR, 05', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: C1, peripheral: SEMC, signal: 'ADDR, 06', pin_signal: GPIO_EMC_B1_15}
  - {pin_num: D3, peripheral: SEMC, signal: 'ADDR, 07', pin_signal: GPIO_EMC_B1_16}
  - {pin_num: B3, peripheral: SEMC, signal: 'ADDR, 08', pin_signal: GPIO_EMC_B1_17}
  - {pin_num: B4, peripheral: SEMC, signal: 'ADDR, 09', pin_signal: GPIO_EMC_B1_18}
  - {pin_num: C4, peripheral: SEMC, signal: 'ADDR, 11', pin_signal: GPIO_EMC_B1_19}
  - {pin_num: C3, peripheral: SEMC, signal: 'ADDR, 12', pin_signal: GPIO_EMC_B1_20}
  - {pin_num: G2, peripheral: SEMC, signal: 'BA, 0', pin_signal: GPIO_EMC_B1_21}
  - {pin_num: H2, peripheral: SEMC, signal: 'BA, 1', pin_signal: GPIO_EMC_B1_22}
  - {pin_num: B2, peripheral: SEMC, signal: 'ADDR, 10', pin_signal: GPIO_EMC_B1_23}
  - {pin_num: J5, peripheral: SEMC, signal: semc_cas, pin_signal: GPIO_EMC_B1_24}
  - {pin_num: J4, peripheral: SEMC, signal: semc_ras, pin_signal: GPIO_EMC_B1_25}
  - {pin_num: J3, peripheral: SEMC, signal: semc_clk, pin_signal: GPIO_EMC_B1_26}
  - {pin_num: G5, peripheral: SEMC, signal: semc_cke, pin_signal: GPIO_EMC_B1_27}
  - {pin_num: E5, peripheral: SEMC, signal: semc_we, pin_signal: GPIO_EMC_B1_28}
  - {pin_num: E6, peripheral: SEMC, signal: 'CS, 0', pin_signal: GPIO_EMC_B1_29}
  - {pin_num: E3, peripheral: SEMC, signal: 'DATA, 08', pin_signal: GPIO_EMC_B1_30}
  - {pin_num: D2, peripheral: SEMC, signal: 'DATA, 09', pin_signal: GPIO_EMC_B1_31}
  - {pin_num: D1, peripheral: SEMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_B1_32}
  - {pin_num: E2, peripheral: SEMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_B1_33}
  - {pin_num: E1, peripheral: SEMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_B1_34}
  - {pin_num: F1, peripheral: SEMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_B1_35}
  - {pin_num: G1, peripheral: SEMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_B1_36}
  - {pin_num: H1, peripheral: SEMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_B1_37}
  - {pin_num: J1, peripheral: SEMC, signal: 'DM, 1', pin_signal: GPIO_EMC_B1_38}
  - {pin_num: J2, peripheral: SEMC, signal: semc_dqs, pin_signal: GPIO_EMC_B1_39}
  - {pin_num: K1, peripheral: SEMC, signal: semc_rdy, pin_signal: GPIO_EMC_B1_40}
  - {pin_num: L1, peripheral: SEMC, signal: 'CSX, 0', pin_signal: GPIO_EMC_B1_41}
  - {pin_num: K2, peripheral: SEMC, signal: 'DATA, 16', pin_signal: GPIO_EMC_B2_00}
  - {pin_num: K4, peripheral: SEMC, signal: 'DATA, 17', pin_signal: GPIO_EMC_B2_01}
  - {pin_num: K3, peripheral: SEMC, signal: 'DATA, 18', pin_signal: GPIO_EMC_B2_02}
  - {pin_num: R1, peripheral: SEMC, signal: 'DATA, 19', pin_signal: GPIO_EMC_B2_03}
  - {pin_num: M1, peripheral: SEMC, signal: 'DATA, 20', pin_signal: GPIO_EMC_B2_04}
  - {pin_num: N1, peripheral: SEMC, signal: 'DATA, 21', pin_signal: GPIO_EMC_B2_05}
  - {pin_num: T1, peripheral: SEMC, signal: 'DATA, 22', pin_signal: GPIO_EMC_B2_06}
  - {pin_num: M3, peripheral: SEMC, signal: 'DATA, 23', pin_signal: GPIO_EMC_B2_07}
  - {pin_num: P1, peripheral: SEMC, signal: 'DM, 2', pin_signal: GPIO_EMC_B2_08}
  - {pin_num: N2, peripheral: SEMC, signal: 'DATA, 24', pin_signal: GPIO_EMC_B2_09}
  - {pin_num: R2, peripheral: SEMC, signal: 'DATA, 25', pin_signal: GPIO_EMC_B2_10}
  - {pin_num: L4, peripheral: SEMC, signal: 'DATA, 26', pin_signal: GPIO_EMC_B2_11}
  - {pin_num: M2, peripheral: SEMC, signal: 'DATA, 27', pin_signal: GPIO_EMC_B2_12}
  - {pin_num: K5, peripheral: SEMC, signal: 'DATA, 28', pin_signal: GPIO_EMC_B2_13}
  - {pin_num: M4, peripheral: SEMC, signal: 'DATA, 29', pin_signal: GPIO_EMC_B2_14}
  - {pin_num: L2, peripheral: SEMC, signal: 'DATA, 30', pin_signal: GPIO_EMC_B2_15}
  - {pin_num: P2, peripheral: SEMC, signal: 'DATA, 31', pin_signal: GPIO_EMC_B2_16}
  - {pin_num: T2, peripheral: SEMC, signal: 'DM, 3', pin_signal: GPIO_EMC_B2_17}
  - {pin_num: N3, peripheral: SEMC, signal: semc_dqs4, pin_signal: GPIO_EMC_B2_18}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

